<script lang="ts">
	import { fade } from 'svelte/transition';
</script>

<section class="flex-auto" transition:fade>
	<div class="pt-20 pb-20 2xl:px-64 2xl:pb-32">
		<div class="mb-5 flex flex-col gap-5">
			<h1 class="text-3xl font-medium text-center">Політика конфіденційності</h1>
			<p class="mb-20 text-center">
				Дякуємо, що відвідали наш веб-сайт. Ваша конфіденційність важлива для нас. Ця політика
				конфіденційності пояснює, яку інформацію ми збираємо, як ми її використовуємо, зберігаємо і
				захищаємо.
			</p>
		</div>

		<div class="mb-5 flex flex-col gap-5 2xl:mb-10">
			<h6 class="text-center text-xl font-medium 2xl:text-left">Збір інформації</h6>
			<p>
				Ми можемо збирати особисту інформацію, коли ви відвідуєте наш сайт, підписуєтесь на нашу
				розсилку, заповнюєте форму або взаємодієте з нами іншим чином. Особиста інформація може
				включати:
			</p>
			<ul>
				<li>- Ім'я</li>
				<li>- Адреса електронної пошти</li>
				<li>- Телефонний номер</li>
				<li>- Поштова адреса</li>
				<li>- Інші дані, необхідні для надання наших послуг</li>
			</ul>
		</div>

		<div class="mb-5 flex flex-col gap-5 2xl:mb-10">
			<h6 class="text-center text-xl font-medium 2xl:text-left">Використання інформації</h6>
			<p>Зібрана інформація може бути використана для:</p>
			<ul>
				<li>- Надання та покращення наших послуг</li>
				<li>- Персоналізації вашого досвіду</li>
				<li>- Відправлення періодичних електронних листів (за вашою згодою)</li>
				<li>- Відповіді на ваші запити та надання підтримки клієнтам</li>
			</ul>
		</div>

		<div class="mb-5 flex flex-col gap-5 2xl:mb-10">
			<h6 class="text-center text-xl font-medium 2xl:text-left">Захист інформації</h6>
			<p>
				Ми впроваджуєемо різноманітні заходи безпеки для захисту вашої особистої інформації. Серед
				цих заходів:
			</p>
			<ul>
				<li>- Використання безпечних серверів</li>
				<li>- Шифрування конфіденційних даних</li>
				<li>- Обмеження доступу до інформації тільки для уповноважених осіб</li>
				<li>- Регулярне оновлення наших систем безпеки</li>
			</ul>
		</div>

		<div class="mb-5 flex flex-col gap-5 2xl:mb-10">
			<h6 class="text-center text-xl font-medium 2xl:text-left">
				Розкриття інформації третім сторонам
			</h6>
			<p>
				Ми не продаємо, не обмінюємо та не передаємо вашу особисту інформацію третім сторонам без
				вашої згоди, за винятком наступних випадків:
			</p>
			<ul>
				<li>- Виконання вимог законодавства</li>
				<li>- Захист наших прав та власності</li>
				<li>
					- Надання послуг нашими партнерами, які зобов'язуються зберігати конфіденційність
					інформації
				</li>
			</ul>
		</div>

		<div class="mb-5 flex flex-col gap-5 2xl:mb-10">
			<h6 class="text-center text-xl font-medium 2xl:text-left">
				Зміни до Політики конфіденційності
			</h6>
			<p>
				Ми залишаємо за собою право оновлювати цю політику конфіденційності в будь-який час. Всі
				зміни будуть опубліковані на цій сторінці. Рекомендуємо періодично переглядати цю сторінку,
				щоб бути в курсі будь-яких змін.
			</p>
		</div>

		<div class="flex flex-col gap-5">
			<h6 class="text-center text-xl font-medium 2xl:text-left">Контактна інформація</h6>
			<p>
				Якщо у вас виникли питання або пропозиції щодо нашої політики конфіденційності, будь ласка,
				зв'яжіться з нами за наступними контактними даними:
			</p>
			<a class="underline" href="tel:+380930343344">+380 (93) 034 33 44</a>
			<a class="underline" href="mailto:precedent.prava@gmail.com">precedent.prava@gmail.com</a>
		</div>
	</div>
</section>
