<script lang="ts">
	import Fade from '../Fade.svelte';
</script>

<section id="about-us" class="bg-about-as pt-20 pb-11">
	<div class="container mx-auto px-20 max-lg:px-10 max-md:px-8">
		<div class="flex gap-28 justify-between max-xl:flex-col">
			<article class="color-292424 w-1/2 max-xl:w-full">
				<Fade>
					<h3 class="main-title mb-10">Про нас</h3>
				</Fade>

				<div class="flex flex-col gap-5">
					<Fade>
						<p>
							Наше адвокатське об'єднання <span class="font-semibold">"Прецедент права"</span> існує
							вже понад 8 років, і за цей час ми зарекомендували себе як надійних і компетентних правозахисників.
							Ми пишаємося численними успішними справами та високим рівнем довіри наших клієнтів.
						</p>
					</Fade>
					<Fade>
						<p>
							<span class="font-semibold">Професіоналізм:</span>
							Наша команда складається з висококваліфікованих адвокатів та юристів, кожен з яких має
							значний досвід у своїй спеціалізації. Ми забезпечуємо індивідуальний підхід до кожної справи,
							уважно вивчаючи всі деталі і розробляючи стратегії, що максимально захищають інтереси наших
							клієнтів.
						</p>
					</Fade>
					<Fade>
						<p>
							<span class="font-semibold">Досвід:</span>
							За понад 8 років роботи адвокатське об'єднання
							<span class="font-semibold">"Прецедент права"</span> успішно вирішило безліч юридичних
							питань різної складності. Наші адвокати мають багатий досвід у кримінальному, господарському,
							цивільному, корпоративному та адміністративному праві. Останнім часом наша команда активно
							спеціалізується на військовому праві, що дозволяє нам ефективно вирішувати правові питання,
							пов'язані з військовою сферою. Кожна справа, яку ми ведемо, отримує належну увагу та професійний
							підхід.
						</p>
					</Fade>
					<Fade>
						<p>
							<span class="font-semibold">Репутація:</span>
							Адвокатське об'єднання <span class="font-semibold">"Прецедент права"</span> славиться високим
							рівнем успіху в судових процесах. Ми домоглися значної кількості виправдовувальних вироків
							та виграшів у складних судових спорах. Наша репутація базується на чесності, порядності
							та відданості справі.
						</p>
					</Fade>
					<Fade>
						<p>
							<span class="font-semibold">Чому обрати нас:</span>
							Ми розуміємо, що кожна справа унікальна і вимагає особливого підходу. Наша команда не тільки
							забезпечує високий рівень правової допомоги, але й створює дружню та підтримуючу атмосферу
							для наших клієнтів. Ви можете бути впевнені, що з адвокатським об'єднанням
							<span class="font-semibold">"Прецедент права"</span>
							ваші правові питання будуть вирішені на найвищому рівні.
						</p>
					</Fade>
					<Fade>
						<p>
							Адвокатське об'єднання <span class="font-semibold">"Прецедент права"</span> – це ваша надійна
							правова підтримка у будь-якій ситуації.
						</p>
					</Fade>
				</div>
			</article>

			<Fade>
				<picture class='w-1/2 max-lg:hidden'>
					<source srcset="./img/about-as.webp" type="image/webp" />
					<img class="h-full max-xl:mx-auto" loading="lazy" width="544" height="762" src="./img/about-as.jpg" alt="justice" />
				</picture>
			</Fade>
		</div>
	</div>
</section>
