<script lang="ts">
	import { fade, slide } from 'svelte/transition';

	let selectedCategory: string = 'Все';

	const ourServices: Record<string, string[]> = {
		Все: [
			'Розірвання шлюбу',
			'Стягнення аліментів',
			'Позбавлення батьківських прав',
			'Шлюбний договір та контракт',
			'Встановлення місця проживання дитини з одним з батьків',
			'Поділ спільного майна подружжя',
			'Оформлення відстрочки від мобілізації',
			'Звільнення з військової служби або переміщення',
			'Оскарження постанов військово-лікарської комісії',
			'Отримання компенсаційних виплат чинним військовим',
			'Оскарження дій або бездіяльності субʼєкта владних повноважень',
			'Консультації з подання та змін до декларацій (НАЗК)',
			'Оскарження постанов при вчинення корупційних правопорушень',
			'Захист у справах про адміністративне правопорушення',
			'Оскарження адміністративних протоколів та постанов (ДТП, керування транспортним засобом у стані алкогольного спʼяніння, тощо)',
			'Цивільні спори',
			'Стягнення заборгованості',
			'Захист прав споживачів',
			'Купівля-продаж нерухомості',
			'Допомога при ДТП',
			'Земельні та житлові спори',
			'Спори з фінансовими та банківськими установами',
			'Спадкування',
			'Вступ у спадщину',
			'Захист інтелектуальної власності',
			'Зняття арешту з майна',
			'Виконавче провадження',
			'Захист інвестицій',
			'Корпоративні спори',
			'Захист інвестицій',
			'Захист бізнесу від рейдерства',
			'Стягнення за договором поставки',
			'Ліквідація юридичної особи',
			'Захист честі, гідності та ділової репутації',
			'Банкрутство',
			'Захист інтелектуальної власності',
			'Захист криптовалютних інвестицій',
			'Перетин кордону',
			'Міграційні послуги',
			'Послуги з відкриття юридичної особи за кордоном',
			'Укладання шлюбу за кордоном',
			'Представництво інтересів у консульських установах',
			'Захист у кримінальному провадженні',
			'Захист під час досудового розслідування',
			'Захист інтересів під час тимчасового затримання особи, арешту майна та застосування інших заходів забезпечення',
			'Представництво під час проведення слідчих дій',
			'Надання консультацій на будь-якому етапі провадження'
		],
		'Сімейне право': [
			'Розірвання шлюбу',
			'Стягнення аліментів',
			'Позбавлення батьківських прав',
			'Шлюбний договір та контракт',
			'Встановлення місця проживання дитини з одним з батьків',
			'Поділ спільного майна подружжя'
		],
		'Військове право': [
			'Оформлення відстрочки від мобілізації',
			'Звільнення з військової служби або переміщення',
			'Оскарження постанов військово-лікарської комісії',
			'Отримання компенсаційних виплат чинним військовим'
		],
		'Адміністративне право': [
			'Оскарження дій або бездіяльності субʼєкта владних повноважень',
			'Консультації з подання та змін до декларацій (НАЗК)',
			'Оскарження постанов при вчинення корупційних правопорушень'
		],
		'Адміністративні провадження': [
			'Оскарження адміністративних протоколів та постанов (ДТП, керування транспортним засобом у стані алкогольного спʼяніння, тощо)',
			'Захист у справах про адміністративне правопорушення'
		],
		'Цивільне право': [
			'Цивільні спори',
			'Стягнення заборгованості',
			'Захист прав споживачів',
			'Купівля-продаж нерухомості',
			'Допомога при ДТП',
			'Земельні та житлові спори',
			'Спори з фінансовими та банківськими установами',
			'Спадкування',
			'Вступ у спадщину',
			'Захист інтелектуальної власності',
			'Зняття арешту з майна',
			'Виконавче провадження',
			'Захист інвестицій'
		],
		'Господарське право': [
			'Корпоративні спори',
			'Захист інвестицій',
			'Захист бізнесу від рейдерства',
			'Стягнення за договором поставки',
			'Ліквідація юридичної особи',
			'Захист честі, гідності та ділової репутації',
			'Банкрутство',
			'Захист інтелектуальної власності',
			'Захист криптовалютних інвестицій'
		],
		'Міграційне право та юридична допомога за кордоном': [
			'Перетин кордону',
			'Міграційні послуги',
			'Послуги з відкриття юридичної особи за кордоном',
			'Укладання шлюбу за кордоном',
			'Представництво інтересів у консульських установах'
		],
		'Кримінальне право': [
			'Захист у кримінальному провадженні',
			'Захист під час досудового розслідування',
			'Захист інтересів під час тимчасового затримання особи, арешту майна та застосування інших заходів забезпечення',
			'Представництво під час проведення слідчих дій',
			'Надання консультацій на будь-якому етапі провадження'
		]
	};

	function toggleCategory(category: string) {
		selectedCategory = selectedCategory === category ? '' : category;
	}
</script>

<section id="our-serveces">
	<div class="container">
		<div>
			<h6 class="main-title mb-24">Наші послуги</h6>

			<div class="category">
				{#each Object.keys(ourServices) as category}
					<button
						class={selectedCategory === category ? 'active' : ''}
						type="button"
						title={selectedCategory === category ? 'Сховати' : 'Показати'}
						aria-label={selectedCategory === category ? 'Сховати' : 'Показати'}
						onclick={() => toggleCategory(category)}
					>
						{category}
					</button>
				{/each}
			</div>

			{#if selectedCategory}
				<div transition:slide>
					<div transition:fade>
						<ul>
							{#each ourServices[selectedCategory] as service}
								<li class="max-md:flex-col max-md:text-center p-5 pr-14 max-md:p-5">
									{service}

									<button class=" text-nowrap" type="button"> Отримати консультацію </button>
								</li>
							{/each}
						</ul>
					</div>
				</div>
			{/if}
		</div>
	</div>
</section>

<style lang="postcss">
	section {
		padding-bottom: 120px;
		
		.active {
			background-color: var(--color-dfdfdf);
		}

		> div {
			> div {
				> .category {
					display: flex;
					flex-wrap: wrap;
					row-gap: 20px;
					justify-content: center;
					margin-bottom: 80px;

					> button {
						border: 1px solid var(--color-dfdfdf);
						padding: 10px;
						cursor: pointer;
						transition: background-color 0.4s ease-in-out;
						margin: 0;
						line-height: 1;

						&:hover {
							@media (hover: hover) {
								background-color: var(--color-cab18a);
							}
						}
					}
				}

				ul {
					display: flex;
					flex-direction: column;
					gap: 40px;
					
					> li {
						display: flex;
						align-items: center;
						justify-content: space-between;
						gap: 10px;
						box-shadow:
							28px 15px 13px rgba(138, 133, 133, 0.01),
							16px 8px 11px rgba(138, 133, 133, 0.05),
							7px 4px 8px rgba(138, 133, 133, 0.09),
							2px 1px 4px rgba(138, 133, 133, 0.1);
						border-radius: 20px;
						/* padding: 20px 60px 20px 20px; */

						> button {
							cursor: pointer;
							background-color: var(--color-cab18a);
							border-radius: 4px;
							padding: 10px 20px;
							color: var(--color-white);
							transition: background-color 0.4s ease-in-out;

							&:hover {
								@media (hover: hover) {
									background-color: var(--color-dfdfdf);
								}
							}
						}
					}
				}
			}
		}
	}
</style>
