<script lang="ts">
	import Fade from '$lib/components/Fade.svelte';
	import ArrowRightIcon from '$lib/icons/ArrowRightIcon.svelte';
	import { fade, slide } from 'svelte/transition';

	let { toggleInfo, isShowInfo } = $props();
</script>

<Fade>
	<div class="team-container">
		<picture class="max-w-full">
			<source srcset="/img/our-team-five.webp" type="image/webp" />
			<img
				class="team-img"
				loading="lazy"
				width="510"
				height="596"
				src="/img/our-team-five.jpg"
				alt="Team five"
			/>
		</picture>

		<div class="color-292424 w-1/2 max-lg:w-full max-lg:text-center">
			<h6 class="team-title">Лілія Братим</h6>

			<span class="team-subtitle">Старший консультант</span>

			<p class="our-team-p">
				<span class="font-semibold">Професійний досвід:</span>
				<br />
				Лілія Братим розпочала свою юридичну кар’єру у 2004 році у відділі економіки слідчого відділу
				Міністерства внутрішніх справ України. За час своєї кар’єри вона обіймала різні посади, включаючи
				старшого слідчого та роботу в міграційній службі України.
			</p>

			<div class="max-xl:hidden">
				<p class="our-team-p">
					<span class="font-semibold">Спеціалізація:</span>
					<br />
					Лілія спеціалізується на міжнародному праві, зовнішньоекономічній діяльності, міграційному
					праві, консульських і дипломатичних зносинах. Вона також має великий досвід у сфері бізнесу
					та електронної комерції, включаючи крипто право та ІТ право.
				</p>

				<p class="our-team-p">
					<span class="font-semibold">Досвід:</span>
					<br />
					З 20-річним стажем у юридичній практиці, Лілія втілює юридичну майстерність та міжнародний
					досвід. Вона не тільки розуміє закони, але й передбачає їх вплив на ваш бізнес та життя.
				</p>

				<p class="our-team-p">
					<span class="font-semibold">Чому обрати Лілію?</span>
					<br />
					Лілія володіє кількома мовами, включаючи англійську, німецьку, турецьку та грузинську, і є
					стратегічним партнером у сфері міжнародного права, економіки та бізнесу. Вона має глибокі знання
					та практичний досвід у Європейському Союзі, країнах Кавказу та Азії, зокрема у бізнесі та електронній
					комерції. Її робота в Грузії, Туреччині, Китаї та країнах ЄС надає їй унікальний інсайт, який
					вона використовує для захисту інтересів своїх клієнтів.
					<br />
					<br />
					У світі, де криптовалюта та ІТ право стають все більш актуальними, Лілія пропонує передові
					рішення у цих швидко розвиваючихся галузях. Вона забезпечує захист ваших інтересів на крипто-платформах
					та кібербезпеку, допомагає розуміти оподаткування та легально працювати в різних країнах світу.
					Лілія - експерт, який не тільки виведе вас зі складних юридичних лабіринтів, але й допоможе
					будувати міцний фундамент для вашого майбутнього успіху у бізнесі та інвестиціях.
				</p>
			</div>

			<div class="max-md:visible">
				{#if isShowInfo}
					<div transition:slide>
						<div class="flex flex-col" transition:fade>
							<p class="our-team-p">
								<span class="font-semibold">Спеціалізація:</span>
								<br />
								Діана спеціалізується на корпоративних спорах та договірному праві,а також на судових
								процесах з адміністративного права. Її експертні знання та досвід допомогли врятувати
								не одне підприємство від правових труднощів.
							</p>

							<p class="our-team-p">
								<span class="font-semibold">Особисті якості:</span>
								<br />
								Нехай Вас не бентежить вік та привабливість Діани. Вона є відмінним спеціалістом, яка
								відзначається виконавчістю, чесністю та порядністю. Її професіоналізм, уважність до деталей
								та відданість своїй роботі забезпечують успішний результат кожної справи, якою вона займається.
							</p>

							<p class="our-team-p">
								<span class="font-semibold">Чому обрати Діану:</span>
								<br />
								Діана Лісіна - це надійний партнер у вирішенні юридичних питань.Її компетентність, відповідальність
								та прагнення досягати найкращих результатів роблять її незамінною для клієнтів, які шукають
								надійну правову підтримку.
							</p>
						</div>
					</div>
				{/if}

				<button
					class="cursor-pointer xl:hidden"
					onclick={toggleInfo}
					type="button"
					aria-label={isShowInfo ? 'Показати інформацію' : 'Сховати інформацію'}
					title={isShowInfo ? 'Показати інформацію' : 'Сховати інформацію'}
				>
					{#if isShowInfo}
						<span> Сховати </span>
					{:else}
						<span>
							Читати далі

							<i>
								<ArrowRightIcon />
							</i>
						</span>
					{/if}
				</button>
			</div>
		</div>
	</div>
</Fade>
